package ru.geekbrains.lesson4.main;


/**
 * 1. Создать сущность «категория» (id, название, список товаров) и соответствующую таблицу в БД. Заполнить таблицу тестовыми данными.
 * 2. Вывести каталоги с товарами в консоль.
 * 3. Написать запросы к репозитариям и вывести товар с:
 * a. минимальной ценой в каталоге,
 * b. максимальной ценой из общего списка,
 * c. минимальной и максимальной цене в каталоге.
 * <p>
 * 4. * Добавить постраничный вывод в консоль товаров из категории
 */

public class HW4 {
}
